In [27]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [28]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [29]:
# we need to fill median values for NaN values

median_salary_year = df['salary_year_avg'].median()

In [30]:
median_salary_hour = df['salary_hour_avg'].median()
median_salary_hour

45.97999954223633

In [31]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(value = median_salary_year) 
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(value = median_salary_hour)

In [33]:
df_filled.loc[:, 'salary_year_avg':'salary_hour_avg']

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [36]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

In [37]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])
len(df_unique)

508042